In [14]:
import pandas as pd
df = pd.read_csv('./data/category.csv')

In [15]:
df.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [16]:
df.drop('last_update', axis=1, inplace=True)

In [17]:
df.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [18]:
df = df.rename(columns={'name': 'category_name'})

In [19]:
df.head()

   category_id category_name
0            1        Action
1            2     Animation
2            3      Children
3            4      Classics
4            5        Comedy